<?php
$i=0;
while( $i <= 100){
    if( $i % 3 == 0){
        echo "$i <br>";

    }
    $i++;
}

$j = 0;
do{
    if($j == 0 || $j== NAN){
        echo("$j - равно 0 или не число<br>");

    }
    elseif ($j%2==0){
        echo("$j - четное<br>");
    }
    else{
        echo("$j - нечетное число<br>");
    }

    $j++;
}
while($j <= 10);


$lands = ["Московская область" => ["Москва",  "Зеленоград", "Клин"], "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"], "Рязанская область" => ["Рязань", "не Рязань"]];


foreach ($lands as $key => $value){
    echo ("$key :<br>");
    for($i = 0; $i < count($value); $i++){
        if($i ==  count($value) - 1){
            echo " $value[$i].";
        } else{
            echo " $value[$i],";
        }

    }
    echo "<br>";


}


function my_replace($str){
    $new_str = str_replace(" ", "_", $str);
    echo "$new_str";

}

function rus2translit($string) {
    $converter = [
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya']
    ;
    return strtr($string, $converter);
}
function str2url($str) {
    // переводим в транслит
    $str = rus2translit($str);
    $str = my_replace($str);

    return $str;
}
echo(rus2translit("Объявить массив, индексами которого являются буквы русского языка"));


echo "<br>";
my_replace("Написать функцию, которая заменяет в строке пробелы");

echo "<br>";
for($i = 0; $i < 10; print("$i <br>"), $i++){};
